{
  "metadata": {
    "timestamp": "2025-12-17T08:07:29.233088+00:00",
    "pages_crawled": 9,
    "errors": []
  },
  "identity": {
    "company_name": "Basecamp: Project management software, online collaboration",
    "website": "https://www.basecamp.com",
    "tagline": "Wrestling with projects? It doesn’t have to be this hard."
  },
  "contacts": {
    "emails": [
      "david@basecamp.com",
      "jason@basecamp.com"
    ],
    "phones": []
  },
  "social_links": {
    "youtube": "https://www.youtube.com/watch?v=AdazpMjeteE"
  },
  "description": "Basecamp: Project management software, online collaboration We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp is the famously straightforward project management system by 37signals Real world results Features Paths Pricing Sign in Sign up free Real world results Features Paths Pricing Wrestling with projects? It doesn’t have to be this hard. There are lots of ways to manage projects. And there’s plenty of software promising to help. You’ve pr...",
  "business_info": {
    "services": [],
    "pricing": {
      "tiers": [
        "Basic",
        "Pro",
        "Business"
      ],
      "prices": [
        "$15",
        "$299/month",
        "$50/month",
        "$349/month"
      ],
      "trial_available": true,
      "free_option": true
    },
    "target_customers": [
      "Education",
      "Developer",
      "Team",
      "Startup",
      "Freelancer",
      "Business",
      "Consultant",
      "Small business"
    ]
  },
  "key_pages": {
    "visited": [
      "https://www.basecamp.com/pricing",
      "https://www.basecamp.com#other-faqs",
      "https://www.basecamp.com/support",
      "https://www.basecamp.com/#features",
      "https://www.basecamp.com/about",
      "https://www.basecamp.com/justletmedomyjob",
      "https://www.basecamp.com#security-faqs",
      "https://www.basecamp.com/pricing#packages"
    ],
    "page_details": {
      "https://www.basecamp.com/pricing": {
        "text_preview": "Basecamp: Pricing We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp is the no-nonsense project management system by 37signals Real world results Features Paths Pricing Sign in Sign up free Real world results Features Paths Pricing Pick the package that fits you best. And don’t stress — you can always switch packages later. 2,268 sign ups last week Basecamp Free Run one project at a time. Completely free One project 1 GB storage space Upgrade ",
        "title": "Basecamp: Pricing",
        "headings": [
          "Pick the package that fits you best.",
          "Basecamp Free",
          "Run one project at a time.",
          "Basecamp Plus",
          "Ideal for freelancers, startups, and smaller teams."
        ]
      },
      "https://www.basecamp.com#other-faqs": {
        "text_preview": "Basecamp: Project management software, online collaboration We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp is the down-to-earth project management system by 37signals Real world results Features Paths Pricing Sign in Sign up free Real world results Features Paths Pricing Wrestling with projects? It doesn’t have to be this hard. There are lots of ways to manage projects. And there’s plenty of software promising to help. You’ve probably trie",
        "title": "Basecamp: Project management software, online collaboration",
        "headings": [
          "Wrestling with projects? It doesn’t have to be this hard.",
          "Let’s walk through it.",
          "10 seconds after you sign up, clarity sets in.",
          "Projects get teams — and keep teams — organized.",
          "Reports give you confidence to hold people accountable."
        ]
      },
      "https://www.basecamp.com/support": {
        "text_preview": "Basecamp: Get help from the Basecamp support team We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp is the amazingly intuitive project management system by 37signals Real world results Features Paths Pricing Sign in Sign up free Real world results Features Paths Pricing Friendly folks, standing by There are no stupid questions. For pre-sales questions, existing customers who need a hand, or other inquiries, contact us and we’ll get back to yo",
        "title": "Basecamp: Get help from the Basecamp support team",
        "headings": [
          "Friendly folks, standing by"
        ]
      },
      "https://www.basecamp.com/#features": {
        "text_preview": "Basecamp: Project management software, online collaboration We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp is the super organized project management system by 37signals Real world results Features Paths Pricing Sign in Sign up free Real world results Features Paths Pricing Wrestling with projects? It doesn’t have to be this hard. There are lots of ways to manage projects. And there’s plenty of software promising to help. You’ve probably tr",
        "title": "Basecamp: Project management software, online collaboration",
        "headings": [
          "Wrestling with projects? It doesn’t have to be this hard.",
          "Let’s walk through it.",
          "10 seconds after you sign up, clarity sets in.",
          "Projects get teams — and keep teams — organized.",
          "Reports give you confidence to hold people accountable."
        ]
      },
      "https://www.basecamp.com/about": {
        "text_preview": "Basecamp: Where we came from We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp Where we came from Born out of desperate necessity to stop embarrassing ourselves in front of our clients, the story of how Basecamp was born is likely your story, too. Hey there — I’m Jason Fried, one of the co-founders here. I’ve been running 37signals — the business that makes Basecamp — for 23 years. People often ask me why we built Basecamp. They’ve never seen",
        "title": "Basecamp: Where we came from",
        "headings": [
          "Where we came from"
        ]
      },
      "https://www.basecamp.com/justletmedomyjob": {
        "text_preview": "Basecamp: JUST LET ME DO MY JOB We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp Another meeting isn’t the answer. JUST LET ME DO MY JOB. When we released Basecamp over 20 years ago, we needed a better way to manage projects and progress as a team. Email, chat, spreadsheets, calls, scattered documents, information here, there, and everywhere just wasn’t cutting it. Since then, we’ve seen a lot of competitors begin to make similar products, b",
        "title": "Basecamp: JUST LET ME DO MY JOB",
        "headings": [
          "Another meeting isn’t the answer.",
          "JUST LET ME DO MY JOB."
        ]
      },
      "https://www.basecamp.com#security-faqs": {
        "text_preview": "Basecamp: Project management software, online collaboration We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp is the down-to-earth project management system by 37signals Real world results Features Paths Pricing Sign in Sign up free Real world results Features Paths Pricing Wrestling with projects? It doesn’t have to be this hard. There are lots of ways to manage projects. And there’s plenty of software promising to help. You’ve probably trie",
        "title": "Basecamp: Project management software, online collaboration",
        "headings": [
          "Wrestling with projects? It doesn’t have to be this hard.",
          "Let’s walk through it.",
          "10 seconds after you sign up, clarity sets in.",
          "Projects get teams — and keep teams — organized.",
          "Reports give you confidence to hold people accountable."
        ]
      },
      "https://www.basecamp.com/pricing#packages": {
        "text_preview": "Basecamp: Pricing We’d like to use cookies to help understand if our ads are working or not. No Yes, that’s fine Basecamp is the wonderfully efficient project management system by 37signals Real world results Features Paths Pricing Sign in Sign up free Real world results Features Paths Pricing Pick the package that fits you best. And don’t stress — you can always switch packages later. 2,268 sign ups last week Basecamp Free Run one project at a time. Completely free One project 1 GB storage spac",
        "title": "Basecamp: Pricing",
        "headings": [
          "Pick the package that fits you best.",
          "Basecamp Free",
          "Run one project at a time.",
          "Basecamp Plus",
          "Ideal for freelancers, startups, and smaller teams."
        ]
      }
    }
  }
}